IT_MOL/src/Documents/ПрисвоитьИнвНомер/ПрисвоитьИнвНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоитьИнвНомер</name>
  <registerRecords>InformationRegister.СерийныеНомера</registerRecords>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IT_MOL/src/InformationRegisters/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СерийныеНомера</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IT_MOL/src/Documents/ПрисвоитьИнвНомер/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	СписокСН = ПолучитьСписокСНСервер(Объект.Модель);
	Для Каждого СН из СписокСН Цикл
		НоваяСтрока = Объект.СерийныеНомера.Добавить();
		НоваяСтрока.СерийныйНомер = СН.Ключ;
		НоваяСтрока.ИнвентарныйНомер = СН.Значение;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСНСервер(Модель)
	
	СписокСН = Новый Структура();
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	СерийныеНомера.МодельОборудования КАК МодельОборудования,
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	СерийныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрСведений.СерийныеНомера КАК СерийныеНомера
	|ГДЕ
	|	СерийныеНомера.МодельОборудования = &Модель";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Модель", Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСН.Вставить(Выборка.СерийныйНомер, Выборка.ИнвентарныйНомер);	
	КонецЦикла;
	Возврат СписокСН;
	
КонецФункции

#КонецОбласти
